validations/SSTHB/coarse_test/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "56000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
14100
(
(-5.01993e-19 -1.71012e-19 -0.0161425)
(-8.22695e-19 -7.03924e-19 -0.0161597)
(-1.01278e-18 -4.06954e-19 -0.0161753)
(-1.01252e-18 -2.82411e-19 -0.0161894)
(-8.94446e-19 -3.20688e-21 -0.0162021)
(-1.11029e-18 1.24231e-19 -0.0162133)
(-1.62783e-18 1.56047e-19 -0.0162233)
(-1.9617e-18 2.25376e-19 -0.0162319)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    wall
    {
        type            noSlip;
    }
}


// ************************************************************************* //
