validations/SSTHB/coarse_test/0/nu
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "56000";
    object      nu;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
14100
(
2.27589e-05
2.39713e-05
2.45822e-05
2.53671e-05
2.62599e-05
2.72207e-05
2.8224e-05
2.92466e-05
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
1.26216e-06
1.26235e-06
1.26258e-06
1.2628e-06
1.26302e-06
1.26322e-06
1.2634e-06
1.26357e-06
...
)
;
    }
}


// ************************************************************************* //
