validations/SSTHB/coarse_test/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "56000";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
28140
(
-4.53787e-23
3.58413e-23
4.5941e-24
4.22546e-24
-6.31707e-23
-1.64181e-23
4.93472e-23
-6.56689e-23
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
        value           nonuniform List<scalar> 
14100
(
7.18494e-07
7.19251e-07
7.19912e-07
7.20502e-07
7.21028e-07
7.21493e-07
7.219e-07
7.22252e-07
...
)
;
    }
    outlet
    {
        type            cyclic;
        value           nonuniform List<scalar> 
14100
(
-7.18494e-07
-7.19251e-07
-7.19912e-07
-7.20502e-07
-7.21028e-07
-7.21493e-07
-7.219e-07
-7.22252e-07
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
