validations/SSTHB/coarse_test/0/strainRate
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "56000";
    object      strainRate;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
14100
(
0.00338917
0.00319773
0.00310914
0.00300219
0.00288907
0.00277639
0.00266765
0.00256517
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
0.528233
0.527957
0.527613
0.527273
0.526951
0.526653
0.526381
0.526137
...
)
;
    }
}


// ************************************************************************* //
