validations/SSTHB/coarse_test/0/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "56000";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<vector> 
14100
(
(0.00308609 0.00140092 5.6943e-17)
(0.00202918 0.00247141 2.07169e-17)
(0.00215617 0.00224002 1.07654e-17)
(0.00222098 0.00202 1.02548e-17)
(0.00225538 0.00180554 1.279e-17)
(0.00226951 0.00159927 1.36628e-17)
(0.00226986 0.00140146 9.52915e-18)
(0.0022608 0.00121196 3.57936e-18)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(-0.363571 0.383205 -6.25927e-15)
(-0.34288 0.401462 1.15675e-15)
(-0.321191 0.418583 7.26215e-15)
(-0.298653 0.434538 5.88845e-15)
(-0.275335 0.449298 2.34141e-15)
(-0.251301 0.462829 2.25225e-15)
(-0.226618 0.475101 1.90994e-15)
(-0.201349 0.486085 1.66475e-15)
...
)
;
    }
}


// ************************************************************************* //
