validations/SSTHB/coarse_test/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleTurbulentFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         500000;

deltaT          1;

writeControl    timeStep;

writeInterval   4000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
   SR
   {
      type strainRate;
      libs ("libstrainRate.so");
      executeControl timeStep;
      writeControl writeTime;
   }

   vor
   {
      type vorticity;
      libs ("libvorticity.so");
      executeControl timeStep;
      writeControl writeTime;
   }
}

libs (
    "libmyIncompressibleTurbulenceModels.so"
);
// ************************************************************************* //
